1. Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe.

In [37]:
import pandas as pd
df = pd.date_range('2019-01-01', '2019-12-31', freq = 'D').to_series()
df.dt.dayofweek

2019-01-01    1
2019-01-02    2
2019-01-03    3
2019-01-04    4
2019-01-05    5
             ..
2019-12-27    4
2019-12-28    5
2019-12-29    6
2019-12-30    0
2019-12-31    1
Freq: D, Length: 365, dtype: int64

Mon = 0, Tue = 1, Wed = 2, Thu = 3, Fri = 4, Sat = 5, Sun = 1

2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names.

In [38]:
Height = pd.Series([23,42,55])
Weight = pd.Series([71,32,48])

Height_series = pd.Series(Height) 
Weight_series = pd.Series(Weight) 
  
frame = { 'Height': Height_series, 'Weight': Weight_series } 
  
result = pd.DataFrame(frame) 
  
print(result)

   Height  Weight
0      23      71
1      42      32
2      55      48

In [39]:
Height = pd.Series([23,42,55])
Weight = pd.Series([71,32,48])
df_hw = pd.DataFrame([Height, Weight]).T
df_hw.head()

    0   1
0  23  71
1  42  32
2  55  48

3. How to get the items of series A not present in series B .From ser1 remove items present in ser2.

In [40]:
# Items of series A not present in series B
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5,6,7,8])
sol1 = ser1.isin(['ser2'])
sol1

0    False
1    False
2    False
3    False
dtype: bool

In [41]:
# From ser1 remove items present in ser2.
ser1 = pd.Series([2,3,4,5])

# Creating index
idx1 = ['a','b','c','d']
ser1.index = idx1
ser1

a    2
b    3
c    4
d    5
dtype: int64

In [42]:
sol2 = ser1.drop(labels = ['d'])
sol2

a    2
b    3
c    4
dtype: int64

4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [43]:
ds = pd.read_csv(r'C:\Users\amits\OneDrive\Desktop\DataScience\end to end data sets\titanic.csv')

In [44]:
ds.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
MinVal = ds['Age'].min()
print('Minimum value of Age is :', MinVal)

Minimum value of Age is : 0.42

In [46]:
Qtr25 = ds['Age'].quantile(0.25)
print('25th Percentile of Age is :', Qtr25)

25th Percentile of Age is : 20.125

In [47]:
Qtr50 = ds['Age'].quantile(0.5)
print('Median of Age is :', Qtr50)

Median of Age is : 28.0

In [48]:
Qtr75 = ds['Age'].quantile(0.75)
print('75th Percentile of Age is :', Qtr75)

75th Percentile of Age is : 38.0

In [49]:
MaxVal = ds['Age'].max()
print('Maximum value of Age is :', MaxVal)

Maximum value of Age is : 80.0

5. How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

In [50]:
Freq = ds['SibSp'].value_counts()
print('Count of unique items in SibsP are')
print(Freq)

Count of unique items in SibsP are
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

6. Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

In [51]:
Freq_Emb = ds['Embarked'].value_counts()
print('Count of unique items in Embarked are')
print(Freq_Emb)

Count of unique items in Embarked are
S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [52]:
ds1 = ds.replace(to_replace ="Q", value ="Other")
ds1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
Freq_Emb1 = ds1['Embarked'].value_counts()
print('Count of unique items in Embarked are')
print(Freq_Emb1)

Count of unique items in Embarked are
S        644
C        168
Other     77
Name: Embarked, dtype: int64

7.  Bin the price column in titanic data set into 5 equal groups and get counts of each bin

In [54]:
ds1['Fare'].min()

0.0

In [55]:
ds1['Fare'].max()

512.3292

In [56]:
ds1['Fare_bins'] = pd.cut(ds1.Fare,bins=[102,204,306,408,512.3292],labels=['1','2','3','4'])

In [57]:
ds1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_bins
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN

8. Count the number of missing values in each column?

In [58]:
print("Missing Values for each feature\n\n",ds1.isnull().sum())

Missing Values for each feature

 PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Fare_bins      838
dtype: int64

9. Get the row number of the 5th largest value in the Age column of titanic dataset?

In [59]:
Large = ds.nlargest(5, ['Age']) 
print(Large)

     PassengerId  Survived  Pclass                                  Name  \
630          631         1       1  Barkworth, Mr. Algernon Henry Wilson
851          852         0       3                   Svensson, Mr. Johan
96            97         0       1             Goldschmidt, Mr. George B
493          494         0       1               Artagaveytia, Mr. Ramon
116          117         0       3                  Connors, Mr. Patrick

      Sex   Age  SibSp  Parch    Ticket     Fare Cabin Embarked
630  male  80.0      0      0     27042  30.0000   A23        S
851  male  74.0      0      0    347060   7.7750   NaN        S
96   male  71.0      0      0  PC 17754  34.6542    A5        C
493  male  71.0      0      0  PC 17609  49.5042   NaN        C
116  male  70.5      0      0    370369   7.7500   NaN        Q

10. Normalize all columns in a dataframe?

11. Get the indices of items of ser2 in ser1 as a list.

In [60]:
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])

In [61]:
s1 = ser1.tolist()
s2 = ser2.tolist()
print(s1)
print(s2)

[10, 9, 6, 5, 3, 1, 12, 8, 13]
[1, 3, 10, 13]

In [62]:
for x in s2:
    for y in s1:
        if x==y:
            print(s1.index(y))

5
4
0
8

12. How to convert a series of date-strings to a timeseries?

In [63]:
Date = pd.Series(['01Jan2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
print(pd.to_datetime(Date))

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

13. Get the day of month, week number, day of year and day of week from ser.

In [64]:
Date_13 = pd.Series(['01 Jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
from dateutil.parser import parse
Date_13 = Date_13.map(lambda x: parse(x))
print("Day of month:")
print(Date_13.dt.day.tolist())
print("Day of year:")
print(Date_13.dt.dayofyear.tolist())
print("Week number:")
print(Date_13.dt.weekofyear.tolist())
print("Day of week:")
print(Date_13.dt.weekday_name.tolist())

Day of month:
[1, 2, 3, 4, 5, 6]
Day of year:
[1, 33, 63, 94, 125, 157]
Week number:
[53, 5, 9, 14, 19, 23]
Day of week:
['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

14. Compute the euclidean distance between series (points) p and q, without using a packaged formula.

In [65]:
p = pd.Series([1,2,3,4,5,6,7,8,9,10])
q = pd.Series([10,9,8,7,6,5,4,3,2,1])

In [66]:
import math
distance = math.sqrt(sum([(a - b) ** 2 for a, b in zip(p, q)]))
print('Euclidean distance between p and q is',distance)

Euclidean distance between p and q is 18.16590212458495

15. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

In [69]:
pd.Series(range(37), index=pd.date_range('2000', freq='D', periods=37))

2000-01-01     0
2000-01-02     1
2000-01-03     2
2000-01-04     3
2000-01-05     4
2000-01-06     5
2000-01-07     6
2000-01-08     7
2000-01-09     8
2000-01-10     9
2000-01-11    10
2000-01-12    11
2000-01-13    12
2000-01-14    13
2000-01-15    14
2000-01-16    15
2000-01-17    16
2000-01-18    17
2000-01-19    18
2000-01-20    19
2000-01-21    20
2000-01-22    21
2000-01-23    22
2000-01-24    23
2000-01-25    24
2000-01-26    25
2000-01-27    26
2000-01-28    27
2000-01-29    28
2000-01-30    29
2000-01-31    30
2000-02-01    31
2000-02-02    32
2000-02-03    33
2000-02-04    34
2000-02-05    35
2000-02-06    36
Freq: D, dtype: int64

16. Import every 50th row of BostonHousing dataset as a dataframe.

In [70]:
BosDs = pd.read_csv(r'C:\Users\amits\OneDrive\Desktop\DataScience\end to end data sets\boston_house_price.csv')

In [71]:
Row50th = BosDs[BosDs.index % 3 == 0] # Selects every 3rd raw starting from 0

In [72]:
Row50th.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
6,0.08829,12.5,7.87,0.0,0.524,6.012,66.6,5.5605,5.0,311.0,15.2,395.60,12.43,22.9
9,0.17004,12.5,7.87,0.0,0.524,6.004,85.9,6.5921,5.0,311.0,15.2,386.71,17.10,18.9
12,0.09378,12.5,7.87,0.0,0.524,5.889,39.0,5.4509,5.0,311.0,15.2,390.50,15.71,21.7